## Terraform Summary

| Step                         | Result  |
|:-----------------------------|:-------:|
| 🖌  Terraform Format & Style | ✅ |
| ⚙️  Terraform Initialization | ✅ |
| 🤖  Terraform Validation     | ✅ |
| 📖  Terraform Plan           | ✅ |

### Output

<details>
<summary>Validation Output</summary>

```
Success! The configuration is valid.


```

</details>

<details>
<summary>Plan Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ses_receipt_rule.ffis_ingest will be created
+   resource "aws_ses_receipt_rule" "ffis_ingest" {
+       arn           = (known after apply)
+       enabled       = true
+       id            = (known after apply)
+       name          = "grants_ingest-staging-ffis_ingest"
+       recipients    = [
+           "ffis-ingest@staging.grants.usdigitalresponse.org",
        ]
+       rule_set_name = "ffis_ingest-rule-set"
+       scan_enabled  = true
+       tls_policy    = "Require"

+       s3_action {
+           bucket_name       = "grantsingest-staging-grantssourcedata-357150818708-us-west-2"
+           object_key_prefix = "ses/ffis_ingest/new"
+           position          = 1
        }
    }

  # datadog_metric_metadata.custom["grants_ingest.DownloadGrantsGovDB.source_size"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.DownloadGrantsGovDB.source_size"
-       type            = "gauge" -> null
        # (6 unchanged attributes hidden)
    }

  # datadog_metric_metadata.custom["grants_ingest.SplitGrantsGovXMLDB.opportunity.created"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.SplitGrantsGovXMLDB.opportunity.created"
-       type            = "gauge" -> null
        # (5 unchanged attributes hidden)
    }

  # datadog_metric_metadata.custom["grants_ingest.SplitGrantsGovXMLDB.opportunity.skipped"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.SplitGrantsGovXMLDB.opportunity.skipped"
-       type            = "gauge" -> null
        # (5 unchanged attributes hidden)
    }

  # datadog_metric_metadata.custom["grants_ingest.SplitGrantsGovXMLDB.opportunity.updated"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.SplitGrantsGovXMLDB.opportunity.updated"
-       type            = "gauge" -> null
        # (5 unchanged attributes hidden)
    }

  # module.DownloadGrantsGovDB.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-staging-DownloadGrantsGovDB"
      ~ last_modified                  = "2023-04-26T16:23:39.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-DownloadGrantsGovDB:17" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-DownloadGrantsGovDB:17/invocations" -> (known after apply)
      ~ s3_key                         = "builds/93e8799fe8955f03af1e0da558c93f3a08cd6800e15a43c94a7328707cacbfb8.zip" -> "builds/f489547ab06719735147ccf71ffddd06bf21afe5b693c6969bfa196eb3401ec8.zip"
      ~ s3_object_version              = "MjW01cY2ChVS3YOqIIvVIQcQeOtrOTJ2" -> (known after apply)
        tags                           = {}
      ~ version                        = "17" -> (known after apply)
        # (23 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                        = "git.commit.sha:9d1885ea8dfa8a451757126fefa1ca8fce3ed836,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:downloadgrantsgovdb" -> "git.commit.sha:5c5b1afe904a9559de35be145863e50c16224ff7,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:downloadgrantsgovdb"
              ~ "DD_VERSION"                     = "9d1885ea8dfa8a451757126fefa1ca8fce3ed836" -> "5c5b1afe904a9559de35be145863e50c16224ff7"
                # (12 unchanged elements hidden)
            }
        }

        # (2 unchanged blocks hidden)
    }

  # module.DownloadGrantsGovDB.module.lambda_function.aws_lambda_permission.current_version_triggers["Schedule"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "Schedule" -> (known after apply)
      ~ qualifier           = "17" -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.DownloadGrantsGovDB.module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "9c528a1ade981f4f2f738db6e7eb3a9d-2" -> (known after apply)
      ~ id                     = "builds/93e8799fe8955f03af1e0da558c93f3a08cd6800e15a43c94a7328707cacbfb8.zip" -> (known after apply)
      ~ key                    = "builds/93e8799fe8955f03af1e0da558c93f3a08cd6800e15a43c94a7328707cacbfb8.zip" -> "builds/f489547ab06719735147ccf71ffddd06bf21afe5b693c6969bfa196eb3401ec8.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source                 = "builds/93e8799fe8955f03af1e0da558c93f3a08cd6800e15a43c94a7328707cacbfb8.zip" -> "builds/f489547ab06719735147ccf71ffddd06bf21afe5b693c6969bfa196eb3401ec8.zip"
-       tags                   = {} -> null
      ~ version_id             = "MjW01cY2ChVS3YOqIIvVIQcQeOtrOTJ2" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.DownloadGrantsGovDB.module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "sh",
+                       "..",
+                       <<-EOT
                            task build-DownloadGrantsGovDB
                            cd bin/DownloadGrantsGovDB
                        EOT,
                    ],
+                   [
+                       "zip:embedded",
+                       "..",
+                       null,
                    ],
                ]
+               filename      = "builds/f489547ab06719735147ccf71ffddd06bf21afe5b693c6969bfa196eb3401ec8.zip"
+               runtime       = "provided.al2"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/f489547ab06719735147ccf71ffddd06bf21afe5b693c6969bfa196eb3401ec8.plan.json"
+       id                   = (known after apply)
    }

  # module.DownloadGrantsGovDB.module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "8825953297811121139" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/93e8799fe8955f03af1e0da558c93f3a08cd6800e15a43c94a7328707cacbfb8.zip" -> "builds/f489547ab06719735147ccf71ffddd06bf21afe5b693c6969bfa196eb3401ec8.zip"
          ~ "timestamp" = "1682526095346881000" -> "1682548373977149000"
        }
    }

  # module.DownloadGrantsGovDB.module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
      ~ id       = "6020391149957145292" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "built_output_path"    = "builds/93e8799fe8955f03af1e0da558c93f3a08cd6800e15a43c94a7328707cacbfb8.zip" -> "builds/f489547ab06719735147ccf71ffddd06bf21afe5b693c6969bfa196eb3401ec8.zip"
            # (4 unchanged elements hidden)
        }
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-staging-SplitGrantsGovXMLDB"
      ~ last_modified                  = "2023-04-26T16:23:40.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-SplitGrantsGovXMLDB:16" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-SplitGrantsGovXMLDB:16/invocations" -> (known after apply)
      ~ s3_key                         = "builds/327841454dd4b525b6ce1bed97280d371c7a1f2f3872700e8c17fe92e3a840e7.zip" -> "builds/12b1bfc45f14983075717d28d1c68f55d16e2646f583599ece688e043859a896.zip"
      ~ s3_object_version              = "71PfrihBiqwdXMXAMVv5RK_zwioZqU97" -> (known after apply)
        tags                           = {}
      ~ version                        = "16" -> (known after apply)
        # (23 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                          = "git.commit.sha:9d1885ea8dfa8a451757126fefa1ca8fce3ed836,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:splitgrantsgovxmldb" -> "git.commit.sha:5c5b1afe904a9559de35be145863e50c16224ff7,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:splitgrantsgovxmldb"
              ~ "DD_VERSION"                       = "9d1885ea8dfa8a451757126fefa1ca8fce3ed836" -> "5c5b1afe904a9559de35be145863e50c16224ff7"
                # (15 unchanged elements hidden)
            }
        }

        # (2 unchanged blocks hidden)
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "16" -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "fcc6d59e0693054da846dd8c72f87bb9-2" -> (known after apply)
      ~ id                     = "builds/327841454dd4b525b6ce1bed97280d371c7a1f2f3872700e8c17fe92e3a840e7.zip" -> (known after apply)
      ~ key                    = "builds/327841454dd4b525b6ce1bed97280d371c7a1f2f3872700e8c17fe92e3a840e7.zip" -> "builds/12b1bfc45f14983075717d28d1c68f55d16e2646f583599ece688e043859a896.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source                 = "builds/327841454dd4b525b6ce1bed97280d371c7a1f2f3872700e8c17fe92e3a840e7.zip" -> "builds/12b1bfc45f14983075717d28d1c68f55d16e2646f583599ece688e043859a896.zip"
-       tags                   = {} -> null
      ~ version_id             = "71PfrihBiqwdXMXAMVv5RK_zwioZqU97" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "sh",
+                       "..",
+                       <<-EOT
                            task build-SplitGrantsGovXMLDB
                            cd bin/SplitGrantsGovXMLDB
                        EOT,
                    ],
+                   [
+                       "zip:embedded",
+                       "..",
+                       null,
                    ],
                ]
+               filename      = "builds/12b1bfc45f14983075717d28d1c68f55d16e2646f583599ece688e043859a896.zip"
+               runtime       = "provided.al2"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/12b1bfc45f14983075717d28d1c68f55d16e2646f583599ece688e043859a896.plan.json"
+       id                   = (known after apply)
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "8839755085565431032" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/327841454dd4b525b6ce1bed97280d371c7a1f2f3872700e8c17fe92e3a840e7.zip" -> "builds/12b1bfc45f14983075717d28d1c68f55d16e2646f583599ece688e043859a896.zip"
          ~ "timestamp" = "1682526095498705000" -> "1682548373895024000"
        }
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
      ~ id       = "8227852511569692076" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "built_output_path"    = "builds/327841454dd4b525b6ce1bed97280d371c7a1f2f3872700e8c17fe92e3a840e7.zip" -> "builds/12b1bfc45f14983075717d28d1c68f55d16e2646f583599ece688e043859a896.zip"
            # (4 unchanged elements hidden)
        }
    }

Plan: 11 to add, 6 to change, 8 to destroy.
```

</details>

*Pusher: @TylerHendrickson, Action: `pull_request`, Workflow: [`Continuous Integration`](https://github.com/usdigitalresponse/grants-ingest/actions/runs/4813973382)*